OpenFOAM_6/tutorials/lagrangian/reactingParcelFoam/counterFlowFlame2DLTS/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    fuel
    {
        type            fixedFluxPressure;
    }

    air
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            prghTotalPressure;
        p0              $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
